Config/Catalogs/ВидыКартСведенийОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКартСведенийОбИмуществе</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаУчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборОбъектаУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКартРеестраИмущества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыКартСведенийОбИмуществе/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	УстановитьОтборПоВладельцу();
	УстановитьТипОбъектаУчета();
	УстановитьПредставление();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Источник = Новый Массив;
	Источник.Добавить(Метаданные.Справочники.РеквизитыСведенийОбИмуществе);
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, Новый Структура("КоманднаяПанель, Источники, ПрефиксГрупп", Элементы.СписокРеквизитов.КоманднаяПанель, Источник, "Элемент"));
	Источник = Новый Массив;
	Источник.Добавить(Метаданные.Справочники.ПечатныеФормыВидовКартСведенийОбИмуществе);
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, Новый Структура("КоманднаяПанель, Источники, ПрефиксГрупп", Элементы.ПечатныеФормы.КоманднаяПанель, Источник, "Печать"));
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СписокРеквизитов);
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ПечатныеФормы);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаНастройкиОтбора" Тогда 	
		
		Если ВыбранноеЗначение <> Неопределено Тогда			
			Объект.ОтборОбъектаУчета	= ВыбранноеЗначение.НастройкиОтбора;
			ПредставлениеОтбора			= ВыбранноеЗначение.ПредставлениеОтбора;
			Модифицированность = Истина;
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ТипОбъектаУчета = Новый ХранилищеЗначения(ТипОбъектаУчета);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	УстановитьОтборПоВладельцу();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОбъектаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ТипЗначения,НастройкиОтбора", ТипОбъектаУчета, Объект.ОтборОбъектаУчета);	
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиОтбора", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтборОбъектаУчетаОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ОтборОбъектаУчета = "";
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокРеквизитов

&НаКлиенте
Процедура СписокРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед добавлением реквизитов необходимо записать вид карты'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписокРеквизитовПроверить(Команда)
	
	СписокРеквизитовПроверитьНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, "ru = 'Предварительный просмотр реквизитов возможен только после записи вида карты'", 15);
		Возврат;
	КонецЕсли;
	
	ИсточникиДанных = Новый Массив;
	ИсточникиДанных.Добавить(Новый Структура("ИмяИсточника,ТипИсточника", "Объект", "ДокументОбъект.РегистрацияСведенийОбИмуществе"));
	ИсточникиДанных.Добавить(Новый Структура("ИмяИсточника,ТипИсточника", "РеестровыйУчет", "РегистрСведенийМенеджерЗаписи.СведенияРеестровогоУчетаИмущества"));
	
	ПараметрыФормы = Новый Структура("ВладелецРеквизитов, ИсточникиДанных", Объект.Ссылка, ИсточникиДанных); 
	ОткрытьФорму("Справочник.РеквизитыСведенийОбИмуществе.Форма.ФормаДополнительная", ПараметрыФормы);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если Лев(Команда.Имя, 7) = "Элемент" Тогда
		ОбъектИлиТаблицаФормы = Элементы.СписокРеквизитов;
	ИначеЕсли Лев(Команда.Имя, 6) = "Печать" Тогда
	    ОбъектИлиТаблицаФормы = Элементы.ПечатныеФормы;
	Иначе
		Возврат;
	КонецЕсли;	
		
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ОбъектИлиТаблицаФормы);
	
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	
	Если Лев(Контекст.ИмяКомандыВФорме, 7) = "Элемент" Тогда
		ОбъектИлиТаблицаФормы = Элементы.СписокРеквизитов;
	ИначеЕсли Лев(Контекст.ИмяКомандыВФорме, 6) = "Печать" Тогда
	    ОбъектИлиТаблицаФормы = Элементы.ПечатныеФормы;
	Иначе
		Возврат;
	КонецЕсли;	
	
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, ОбъектИлиТаблицаФормы, Результат);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СписокРеквизитов);
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ПечатныеФормы);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	Справочники.РеквизитыСведенийОбИмуществе.УстановитьУсловноеОформлениеСписка(УсловноеОформление);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоВладельцу()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокРеквизитов.Отбор, "Владелец", Объект.Ссылка, , , Истина);	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокРеквизитов, "Владелец", Объект.Ссылка, Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПечатныеФормы.Отбор, "Владелец", Объект.Ссылка,,, Истина);
	
КонецПроцедуры

&НаСервере
Функция УстановитьТипОбъектаУчета()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	ВидыКартСведенийОбИмуществе.ТипОбъектаУчета
				   |ИЗ
				   |	Справочник.ВидыКартСведенийОбИмуществе КАК ВидыКартСведенийОбИмуществе
				   |ГДЕ
				   |	ВидыКартСведенийОбИмуществе.Ссылка = &Ссылка";

	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		ТипОбъектаУчета = Выборка.ТипОбъектаУчета.Получить();	
	КонецЕсли;
	
	Элементы.ТипОбъектаУчета.ДоступныеТипы = Метаданные.ОпределяемыеТипы.ОбъектУчетаИмущества.Тип;
	
КонецФункции

&НаСервере
Процедура УстановитьПредставление()
	
	Если Не ПустаяСтрока(Объект.ОтборОбъектаУчета) Тогда
		ПараметрыНастройки = Новый Структура("ТипЗначения,НастройкиОтбора", ТипОбъектаУчета, Объект.ОтборОбъектаУчета);
		ОбщегоНазначенияБГУ.ИнициализироватьОтборКомпоновщикаНастроек(ПараметрыНастройки, ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокРеквизитовПроверитьНаСервере(Владелец)
	
	Справочники.РеквизитыСведенийОбИмуществе.ПроверитьРеквизиты(Владелец);
	
КонецПроцедуры

#КонецОбласти
